098_Мастер_Ра_разработка/src/Reports/АктСверкиС_Заказчиком/АктСверкиС_Заказчиком.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>АктСверкиС_Заказчиком</name>
</mdclass:Report>

098_Мастер_Ра_разработка/src/AccumulationRegisters/ВзаиморасчетыПоЗаказам/ВзаиморасчетыПоЗаказам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчетыПоЗаказам</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Акт</name>
    <type>
      <types>DocumentRef.Акт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

098_Мастер_Ра_разработка/src/Documents/Заявка/Заявка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заявка</name>
  <registerRecords>InformationRegister.СтоимостиЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоЗаказам</registerRecords>
  <registerRecords>InformationRegister.Заказы</registerRecords>
  <attributes>
    <name>Агент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БезКонтроляПроизводства</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Бренд</name>
    <type>
      <types>CatalogRef.Бренды</types>
    </type>
  </attributes>
  <attributes>
    <name>ВертикальИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вечер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПродукции</name>
    <type>
      <types>EnumRef.ВидыПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРабот</name>
    <type>
      <types>EnumRef.ВидыРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыборкаПлотернаяРезка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоризонтальИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИВремяДоставки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИВремяМонтажа</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИВремяСборки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопТребованиеКЗаказу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопТребованиеКУпаковке</name>
    <type>
      <types>EnumRef.ДопТребованияКУпаковке</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьНаряд</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьСвязанныйЗаказ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнформацияВСчете</name>
    <type>
      <types>CatalogRef.Продукция</types>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоЗаВесьЗаказ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСторон</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляВодителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКомДира</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>МаржаЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МатериалОсновы</name>
    <type>
      <types>CatalogRef.МатериалОсновы</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>МонтажкаПлотернаяРезка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МонтажникиСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НадписьНаУпаковке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НулеваяЦена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщаяПлощадьИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщееКоличествоПогонныхМетров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Переделка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Период</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечатнаяМашина</name>
    <type>
      <types>CatalogRef.ПечатныеМашины</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказатьВсё</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоляПриПечати</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаПеределки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешениеПечати</name>
    <type>
      <types>EnumRef.РазрешенияПечати</types>
    </type>
  </attributes>
  <attributes>
    <name>РасположениеПолей</name>
    <type>
      <types>CatalogRef.РасположениеПолей</types>
    </type>
  </attributes>
  <attributes>
    <name>СвязанныйЗаказ</name>
    <type>
      <types>DocumentRef.Заявка</types>
    </type>
  </attributes>
  <attributes>
    <name>СоздатьНаряд</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаТарифа</name>
    <type>
      <types>EnumRef.СпособыРасчетаТарифов</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИзготовленияЗаказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.Статусы</types>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>DocumentRef.Счет</types>
    </type>
  </attributes>
  <attributes>
    <name>ТехническиеХарактеристики</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тираж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОплаты</name>
    <type>
      <types>EnumRef.ФормыОплат</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветопробаКЗаказу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаЗаКвМетр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаЗаЭкземпляр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Затраты</name>
    <attributes>
      <name>РКО</name>
      <type>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
        <types>DocumentRef.ПрочиеЗатраты</types>
      </type>
    </attributes>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МатериалыОсновы</name>
    <attributes>
      <name>МатериалОсновы</name>
      <type>
        <types>CatalogRef.МатериалОсновы</types>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПостпечатныеРаботы</name>
    <attributes>
      <name>ВидРаботПоПериметру</name>
      <type>
        <types>EnumRef.ВидРаботПоПериметру</types>
      </type>
    </attributes>
    <attributes>
      <name>РасстояниеМеждуЛюверсами</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДиаметрЛюверсов</name>
      <type>
        <types>EnumRef.ДиаметрЛюверсов</types>
      </type>
    </attributes>
    <attributes>
      <name>Размещение</name>
      <type>
        <types>CatalogRef.РасположениеПолей</types>
      </type>
    </attributes>
    <attributes>
      <name>ГлубинаКарманов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Карманы</name>
      <type>
        <types>EnumRef.Карманы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвязанныеДокументы</name>
    <attributes>
      <name>Докум</name>
      <type>
        <types>DocumentRef.Заявка</types>
      </type>
    </attributes>
    <attributes>
      <name>СвязаннаяЗаявка</name>
      <type>
        <types>DocumentRef.Заявка</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Стоимости</name>
    <attributes>
      <name>Работы</name>
      <type>
        <types>EnumRef.РаботыСтоимости</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаДляКлиента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Файлы</name>
    <attributes>
      <name>ИмяФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Спецификация</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Монтажники</name>
    <attributes>
      <name>Монтажник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Ставка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Дизайнеры</name>
    <attributes>
      <name>Дизайнер</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Ставка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

098_Мастер_Ра_разработка/src/Reports/АктСверкиС_Заказчиком/Forms/ФормаОтчета/Module.bsl
// @strict-types


&НаКлиенте
Процедура Сформировать(Команда)
	
    СформироватьОтчетНаСервере();

КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетНаСервере()
	
	ТабДокумент.Очистить();
	
	Макет =РеквизитФормыВЗначение("Отчет").ПолучитьМакет("Макет1");
	
	 	мТекстЗаголовка = Символ(13)+ "взаимных расчетов по состоянию " + Формат(Период.ДатаОкончания, "ДЛФ=Д") + " между " +
							Организация.Наименование + " и " + Контрагент.НаименованиеПолное;
		мТекстЗаголовка = мТекстЗаголовка + Символ(13) + Символ(13) + Символ(13) + Символ(13);
		мТекстИнформации = "Мы, нижеподписавшиеся _____________________ " + Организация.Наименование + 
							" _____________________ , с одной стороны, и _____________________ " + 
							Контрагент.НаименованиеПолное + " _____________________ , с другой стороны, " +
							"составили настоящий акт сверки в том, состояние взаимных расчетов по данным учета следующее:" + Символ(13) + Символ(13);
		мПоДаннымОрганизации= "По данным " + Организация.Наименование;
		мОтОрганизации 		= "От " + Организация.Наименование;
		
	Шапка = Макет.ПолучитьОбласть("Шапка");

	Шапка.Параметры.ТекстЗаголовка 	= мТекстЗаголовка;
	Шапка.Параметры.ТекстИнформации = мТекстИнформации;
	ТабДокумент.Вывести(Шапка);

	ШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДокумент.Вывести(ШапкаТаблицы);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВзаиморасчетыОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыПоЗаказам.Остатки(&НачДата, Контрагент = &Контрагент) КАК ВзаиморасчетыОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВзаиморасчетыОбороты.Регистратор.Дата КАК РегистраторДата,
		|	ВзаиморасчетыОбороты.Регистратор.Номер КАК РегистраторНомер,
		|	ВЫБОР
		|		КОГДА ВзаиморасчетыОбороты.Регистратор ССЫЛКА Документ.Заявка
		|			ТОГДА ""Продажа""
		|		ИНАЧЕ ""Оплата""
		|	КОНЕЦ КАК ВидОперации,
		|	ВЫБОР
		|		КОГДА ВзаиморасчетыОбороты.Регистратор ССЫЛКА Документ.Заявка
		|			ТОГДА ВзаиморасчетыОбороты.Регистратор.ИтогоЗаВесьЗаказ
		|		ИНАЧЕ ВзаиморасчетыОбороты.Регистратор.СуммаДокумента
		|	КОНЕЦ КАК Сумма,
		|	ВЫБОР
		|		КОГДА ВзаиморасчетыОбороты.Регистратор ССЫЛКА Документ.Заявка
		|			ТОГДА ВзаиморасчетыОбороты.Регистратор.НаименованиеЗаказа
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Описание
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыПоЗаказам.Обороты(&НачДата, &КонДата, Регистратор, Контрагент = &Контрагент) КАК ВзаиморасчетыОбороты
		|
		|УПОРЯДОЧИТЬ ПО
		|	РегистраторДата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВзаиморасчетыОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыПоЗаказам.Остатки(&КонДата, Контрагент = &Контрагент) КАК ВзаиморасчетыОстатки";
		
		Запрос.УстановитьПараметр("НачДата",Период.ДатаНачала);
		Запрос.УстановитьПараметр("КонДата",КонецДня(Период.ДатаОкончания));
		Запрос.УстановитьПараметр("Контрагент",Контрагент);
		
		масРезультатов = Запрос.ВыполнитьПакет();
		
		//Сальдо Начальное
		ВыборкаДетальныеЗаписи = масРезультатов[0].Выбрать();
		СальдоНачальное = Макет.ПолучитьОбласть("СальдоНачальное");
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл		
			СальдоНачальное.Параметры.СальдоНачТекст = "Сальдо на " + Формат(Период.ДатаНачала, "ДЛФ=Д");
			СальдоНачальное.Параметры.СальдоНач = ВыборкаДетальныеЗаписи.СуммаОстаток;
			ТабДокумент.Вывести(СальдоНачальное);
		КонецЦикла;
		
		всегоДт = 0;
		всегоКт = 0;
		
		ВыборкаДетальныеЗаписи = масРезультатов[1].Выбрать();
		Обороты = Макет.ПолучитьОбласть("Обороты");
		НомерС = 1;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Обороты.Параметры.НомерС = НомерС;
			Обороты.Параметры.ВидОперации	= ВыборкаДетальныеЗаписи.ВидОперации;
			Обороты.Параметры.ДатаОперации 	= Формат(ВыборкаДетальныеЗаписи.РегистраторДата, "ДЛФ=Д");
			Обороты.Параметры.Номер 		= ВыборкаДетальныеЗаписи.РегистраторНомер;
			Обороты.Параметры.Описание 		= ВыборкаДетальныеЗаписи.Описание;
			Если ВыборкаДетальныеЗаписи.ВидОперации="Продажа" Тогда 
				Обороты.Параметры.Дебет 		= ВыборкаДетальныеЗаписи.Сумма; 
				Обороты.Параметры.Кредит 		= "";
				всегоДт = всегоДт+ ВыборкаДетальныеЗаписи.Сумма;
			иначе
				Обороты.Параметры.Кредит 		= ВыборкаДетальныеЗаписи.Сумма;
				Обороты.Параметры.Дебет 		= "";
				всегоКт = всегоКт+ ВыборкаДетальныеЗаписи.Сумма;
			КонецЕсли;
			ТабДокумент.Вывести(Обороты);
			НомерС = НомерС+1;
		КонецЦикла;

		ОбИтог = Макет.ПолучитьОбласть("ОборотыИтог");
        ОбИтог.Параметры.ОборотД = всегоДт;
        ОбИтог.Параметры.ОборотК = всегоКт;
		ТабДокумент.Вывести(ОбИтог);

		ВыборкаДетальныеЗаписи = масРезультатов[2].Выбрать();
		СальдоКонечное = Макет.ПолучитьОбласть("СальдоКонечное");
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл		
			СальдоКонечное.Параметры.СальдоКонТекст = "Сальдо на " + Формат(Период.ДатаНачала, "ДЛФ=Д");
			Если ВыборкаДетальныеЗаписи.СуммаОстаток>0 Тогда 
				СальдоКонечное.Параметры.СальдоКон = ВыборкаДетальныеЗаписи.СуммаОстаток;
				впользу =  Организация.Наименование;
			иначе
				СальдоКонечное.Параметры.СальдоКон2 = -ВыборкаДетальныеЗаписи.СуммаОстаток;
				впользу = Контрагент.НаименованиеПолное;
			КонецЕсли;
			ТабДокумент.Вывести(СальдоКонечное);
		КонецЦикла;
		
		облПодвал = Макет.ПолучитьОбласть("Подвал");
		
		ФормСтрока = "Л = ru_RU; ДП = Истина";
		ПарПредмета="рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2";
		ПрописьЧисла = ЧислоПрописью(ВыборкаДетальныеЗаписи.СуммаОстаток, ФормСтрока, ПарПредмета);	
		
		облПодвал.Параметры.ПоДаннымОрганизации = "По данным "+Организация.Наименование;
		
		облПодвал.Параметры.РезультатыСверки = "на "+Формат(Период.ДатаНачала, "ДЛФ=Д")+" задолженность в пользу "+впользу
		+" "+ВыборкаДетальныеЗаписи.СуммаОстаток+" ("+ПрописьЧисла+")";
		
		облПодвал.Параметры.ОтОрганизацииСтрока  = "от "+Организация.Наименование;
	    облПодвал.Параметры.ОтЗаказчикаСтрока  = "от "+Контрагент.НаименованиеПолное;

		ТабДокумент.Вывести(облПодвал);

	
КонецПроцедуры
